[
    {
        "id": 1,
        "name": "Python",
        "img": "https://i.pinimg.com/originals/8f/23/98/8f2398dcd19c6a1776f6b55c83073c67.png",
        "desc": "Python is a high-level, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation. Python is dynamically-typed and garbage-collected. It supports multiple programming paradigms, including structured, object-oriented and functional programming",
        "rating": 4.5,
        "price": 99
    },
    {
        "id": 2,
        "name": "Java",
        "img": "https://smarteria.in/images/smarteria_image/logo-java-png-3.png",
        "desc": "Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible. Java is dynamically-typed and garbage-collected. It supports multiple programming paradigms, including structured, object-oriented and functional programming",
        "rating": 4,
        "price": 97
    },
    {
        "id": 3,
        "name": "JavaScript",
        "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/JavaScript-logo.png/480px-JavaScript-logo.png",
        "desc": "JavaScript, often abbreviated as JS, is a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS. As of 2022, 98% of websites use JavaScript on the client side for webpage behavior, often incorporating third-party libraries",
        "rating": 4.5,
        "price": 99
    },
    {
        "id": 4,
        "name": "GO",
        "img": "https://go.dev/blog/go-brand/Go-Logo/PNG/Go-Logo_Blue.png",
        "desc": "Go is a statically typed, compiled programming language designed at Google by Robert Griesemer, Rob Pike, and Ken Thompson. It is syntactically similar to C, but with memory safety, garbage collection, structural typing, and CSP-style concurrency.",
        "rating": 4,
        "price": 95
    },
    {
        "id": 5,
        "name": "PHP",
        "img": "https://cdn2.iconfinder.com/data/icons/designer-skills/128/code-programming-php-software-develop-command-language-512.png",
        "desc": "PHP is a general-purpose scripting language geared toward web development. It was originally created by Danish-Canadian programmer Rasmus Lerdorf in 1993. The PHP reference implementation is now produced by The PHP Group.",
        "rating": 4.5,
        "price": 96
    },
    {
        "id": 6,
        "name": "Ruby",
        "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Ruby_logo.svg/1024px-Ruby_logo.svg.png",
        "desc": "Ruby is an interpreted, high-level, general-purpose programming language which supports multiple programming paradigms. It was designed with an emphasis on programming productivity and simplicity. In Ruby, everything is an object, including primitive data types.",
        "rating": 4,
        "price": 95
    }
]